app/views/events/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
<h2> 💡 L'organisateur du super évènement : </h2>
<p><%= User.find(@event.creator_id).name %></p>