app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    @event.creator_id = current_user.id
    @event.save
---
INSERT INTO "events" ("creator_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["creator_id", 5], ["created_at", "2018-02-08 19:19:11.432735"], ["updated_at", "2018-02-08 19:19:11.432735"]]

  def subscribe
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]